'''pylypivvv@gmail.com'''

a = input("Введіть своє ім'я: ")
b = input("Введіть своє прізвище: ")
print("Вітаємо в команді", a, b, sep=", ", end="\n\n")

a = int(input("Яка температура замерзання речовини? "))
b = int(input("Яка температура кипіння речовини? "))
x = int(input("При якій температурі речовина знаходиться в рідкому стані? "))
print(a<x<b, end="\n\n")

a = float(input("Введіть коефіцієнти квадратного рівняння:\na = "))
b = float(input('b = '))
c = float(input('c = '))
x1 = (-b+pow((b**2-4*a*c), 0.5))/(2*a)
x2 = (-b-pow((b**2-4*a*c), 0.5))/(2*a)
print(f'Коренями рівняння є числа {x1} і {x2}')
